# 开发人员：DYL
# 开发时间：2022/4/25 19:29

"""
    为什么要将元组设计成不可变序列，因为一旦创建了不可变类型的对象，对象内部的所有数据就不可以被修改了
    这样就避免，免了由于修改数据而导致的错误，这样在多任务的环境下，同时操作对象就不用加锁了（类似于
    Java多线程时加的同步锁）所以在程序中尽量要使用不可变对象。
"""

# 元组中储存的是对象的引用；如果元组中对象本身是不可变对象，则不能在引用其他对象；如果元组中的对象
# 是可变对象，则可变对象的引用不允许改变，但数据可以改变。
t = (10, [20, 30], 9)
print(t)
print(type(t))
print(t[0], type(t[0]), id(t[0]))
print(t[1], type(t[1]), id(t[1]))
print(t[2], type(t[2]), id(t[2]))
# 尝试把t[1]修改成100
print(id(100))
# t[1] = 100  # 此处报错，因为元组是不允许修改元素的,因为元组中的元素是一个个的引用相当于一个个的指向
t[1].append(100)
print(t[1])
print(t, id(t[1]))  # 此处添加元素后的t[1]的地址没发生改变

