# 开发人员：DYL
# 开发时间：2022/4/28 11:02

# 集合：Python内置的数据结构，和列表、字典一样属于可变类型的序列，集合相当于是没有value的字典
# 集合是利用Hash()函数来计算存储位置的，最先放入的元素不一定在最前面。

# 集合的创建方式

# 第一种用{}创建
s = {3, 6, 6, 7, 7, 3, 3, 9}
print(s, type(s))  # 元素不允许重复

# 第二种方式用set()创建
s1 = set(range(6))
print(s1, type(s1))

list1 = [1, 1, 1, 2, 2, 3, 3, 4, 4, 4, 5, 67, 7]
s2 = set(list1)
print(s2, type(s2))  # 将列表类型转换成集合类型

t = tuple((1, 2, 78, 3, 2, 3, 4, 5, 5, 56))
s3 = set(t)
print(s3, type(s3))  # 78跑后面去了，所以说集合中的元素是无序的，它是按照Hash函数来排列的

s4 = set('Python')
print(s4, type(s4))  # 这里也可以看出集合中的元素是无序的

d = {1, 2, 3, 2, 3, 4, 5, 2, 4, 5}
s5 = set(d)  # 字典转集合
print(s5, type(s5))
